ERP DEV.WMS/src/Catalogs/вмс_НастройкиПолейЗадания/вмс_НастройкиПолейЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиПолейЗадания</name>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>DocumentRef.вмс_ЗаданиеКладовщику</types>
      <types>CatalogRef.вмс_ПравилаЗаполненияЗадачиКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкаПолей</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВвода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ввод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сборка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вывод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательныйВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноеЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Страница</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДаннымЗаполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДаннымСохранения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоложениеЗаголовка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Шрифт</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаСтраниц</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вывод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СборщикДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СборщикиДанных</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляДанных</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыВывода</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СборщикиДанных1</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиПолейЗадания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОбновитьНастройкуПолей(СсылкаНастройкиПолей, СтруктураНастройкиПолей) Экспорт
	
	НастройкаПолей = СсылкаНастройкиПолей.ПолучитьОбъект();
	Если НастройкаПолей=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗагрузитьСтруктуруНастройкиПолей(СтруктураНастройкиПолей, НастройкаПолей);
	
	НастройкаПолей.Записать();
	
КонецФункции
	
Функция ПолучитьНастройкуПолейПоВладельцу(Владелец) Экспорт
		
	СсылкаНастройкиПолей = НайтиНастройкуПолейПоВладельцу(Владелец);
	
	Если СсылкаНастройкиПолей=Неопределено Тогда
		СсылкаНастройкиПолей = СоздатьНовыеНастройкиПолей(Владелец);
	КонецЕсли;
	
	Возврат СсылкаНастройкиПолей;
		
КонецФункции
	
Функция НайтиНастройкуПолейПоВладельцу(Владелец) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_НастройкиПолейЗадания.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_НастройкиПолейЗадания КАК вмс_НастройкиПолейЗадания
	|ГДЕ
	|	вмс_НастройкиПолейЗадания.Мастер = &Владелец
	|	И НЕ вмс_НастройкиПолейЗадания.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции 

Функция СоздатьНовыеНастройкиПолей(Владелец) 
	
	НовыйОбъектНастройкиПолей = СоздатьЭлемент();
	НовыйОбъектНастройкиПолей.Наименование = Строка(Владелец);
	НовыйОбъектНастройкиПолей.Мастер = Владелец;
	НовыйОбъектНастройкиПолей.Записать();
	
	Возврат НовыйОбъектНастройкиПолей.Ссылка;
	
КонецФункции

Функция СтруктураНастройкиПолейПоУмолчанию() Экспорт

	СтруктураНастройкиПолей = ПустаяСтруктураНастройкиПолей();
	
	ЗаполнитьНастройкуСтраницДокумента(СтруктураНастройкиПолей);
	
	вмс_РаботаСКоллекциями.СортироватьКоллекцию(СтруктураНастройкиПолей.НастройкаПолей, "ПорядокВвода");
	
	Возврат СтруктураНастройкиПолей;
	
КонецФункции

Функция ЗаполнитьНастройкуСтраницДокумента(СтруктураНастройкиПолей) Экспорт

	НастройкаСтраниц = СтруктураНастройкиПолей.НастройкаСтраниц;
	НастройкаСтраниц.Очистить();
	
	ПС = Обработки.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная.ПрефиксСтраницОперации();
	СборщикДанныхНачало = СборщикДанных(СтруктураНастройкиПолей, "Инфо", "СборщикДанныхСтандартный");
	ДобавитьНастройкуСтраницы(СтруктураНастройкиПолей, ПС + "Инфо", Истина, СборщикДанныхНачало);
	
	СборщикДанныхТоваров = СборщикДанных(СтруктураНастройкиПолей, "ВводДанных",	"СборщикДанныхТоваров", "СборщикДанныхТоваров");
	ДобавитьНастройкуСтраницы(СтруктураНастройкиПолей, ПС + "ВводДанных",	Истина, СборщикДанныхТоваров);
	ДобавитьНастройкуСтраницы(СтруктураНастройкиПолей, ПС + "ПланФакт",	Истина, СборщикДанныхТоваров);
	ДобавитьНастройкуСтраницы(СтруктураНастройкиПолей, ПС + "Факт",		Истина, СборщикДанныхТоваров);
	
	СборщикДанныхЗавершение = СборщикДанных(СтруктураНастройкиПолей, "Завершение", "СборщикДанныхСтандартный");
	ДобавитьНастройкуСтраницы(СтруктураНастройкиПолей, ПС + "Завершение",	Истина, СборщикДанныхЗавершение);
		
КонецФункции

Функция ДобавитьНастройкуСтраницы(СтруктураНастройкиПолей, Имя, Вывод, СборщикДанных)
	НастройкаСтраницы = СтруктураНастройкиПолей.НастройкаСтраниц.Добавить();
	НастройкаСтраницы.Имя = Имя;
	НастройкаСтраницы.Вывод = Вывод;
	НастройкаСтраницы.СборщикДанных = СборщикДанных;
	Возврат НастройкаСтраницы;
КонецФункции

Функция СборщикДанных(СтруктураНастройкиПолей, Страница, ТипСборщика, знач ИмяСборщика=Неопределено) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	СборщикиДанных = СтруктураНастройкиПолей.СборщикиДанных;
	
	ТаблицаСборщиковПоСтраницам = СборщикиДанных.СкопироватьКолонки();
	ТаблицаСборщиковПоСтраницам.Колонки.Добавить("Страница");
	ТаблицаСборщиковПоСтраницам.Очистить();
	
	НастройкаСтраниц = СтруктураНастройкиПолей.НастройкаСтраниц;
	
	Для Каждого ЭлементСборщика Из СборщикиДанных Цикл
		СтраницыСборщика = НастройкаСтраниц.НайтиСтроки(Новый Структура("СборщикДанных", ЭлементСборщика.Имя));
		Если СтраницыСборщика.Количество()=0 Тогда
			ЭлементСборщикПоСтранице = ТаблицаСборщиковПоСтраницам.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементСборщикПоСтранице, ЭлементСборщика);
		Иначе
			Для Каждого ЭлементСтраницы Из СтраницыСборщика Цикл
				ЭлементСборщикПоСтранице = ТаблицаСборщиковПоСтраницам.Добавить();
				ЗаполнитьЗначенияСвойств(ЭлементСборщикПоСтранице, ЭлементСборщика);
				ЭлементСборщикПоСтранице.Страница = ЭлементСтраницы.Имя;
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
	
	НайденныеСборщики = ТаблицаСборщиковПоСтраницам.НайтиСтроки(Новый Структура("Страница, Тип", Страница, ТипСборщика));
	Если НайденныеСборщики.Количество() > 0 Тогда
		Возврат НайденныеСборщики[0].Имя;
	КонецЕсли;
	
	НайденныеСборщики = ТаблицаСборщиковПоСтраницам.НайтиСтроки(Новый Структура("Страница, Тип", Неопределено, ТипСборщика));
	Если НайденныеСборщики.Количество() > 0 Тогда
		Возврат НайденныеСборщики[0].Имя;
	КонецЕсли;
	
	// создадим нового сборщика
	Если ИмяСборщика=Неопределено Тогда
		НомерСборщика = 1;
		//ИмяСборщикаБаза = ТипСборщика;
		ИмяСборщикаБаза = "СборщикДанных" + Страница;
		Пока Истина Цикл
			ИмяСборщика = ИмяСборщикаБаза;
			Если НомерСборщика > 1 Тогда
				// добавим суффикс сборщика
				ИмяСборщика = ИмяСборщика + Формат(НомерСборщика, "ЧГ=0")
			КонецЕсли;
			
			Если СборщикиДанных.НайтиСтроки(Новый Структура("Имя", ИмяСборщика)).Количество()=0 Тогда
				Прервать;
			КонецЕсли;
			
			// с таким именем уже есть
			НомерСборщика = НомерСборщика + 1;
		КонецЦикла;
	КонецЕсли;
	
	СборщикДанных = СборщикиДанных.Добавить();
	СборщикДанных.Имя = ИмяСборщика;
	СборщикДанных.Тип = ТипСборщика;
	
	Возврат ИмяСборщика;
	
КонецФункции

Функция СКДРеквизитовЗадания() Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	СКД = Документы.вмс_ЗаданиеКладовщику.ПолучитьМакет("СКДРеквизитов");
		
	ИсключенияРеквизитов = Новый Соответствие;
	ИсключенияРеквизитов["НастройкаПолей"] = Истина;
	ИсключенияРеквизитов["НастройкаСтраниц"] = Истина;
	
	СинонимыРеквизитов = Новый Соответствие;
	СинонимыРеквизитов["Товары.Номенклатура"] = "Товары.Товар";
	СинонимыРеквизитов["Товары.Количество"] = РК.СтрокуВМассив("Товары.Количество, Товары.КоличествоРазмещено, Товары.КоличествоОтобрано");
	
	ДобавленныеПоляЗапроса = Новый Соответствие;
	
	МетаданныеЗадания = Документы.вмс_ЗаданиеКладовщику.ПустаяСсылка().Метаданные();
	
	СКД = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "Источник1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Набор1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;

	Разделитель = "," + Символы.ПС + Символы.Таб;
	ТекстПолейЗапроса = "";
	Для Каждого Реквизит Из МетаданныеЗадания.СтандартныеРеквизиты Цикл
		ПутьРеквизита = Реквизит.Имя;
		Если ИсключенияРеквизитов[ПутьРеквизита]=Истина Тогда
			Продолжить;
		КонецЕсли;
		Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		Поле.Поле = ПутьРеквизита;
		Поле.ПутьКДанным = "Задание." + ПутьРеквизита;
		ТекстПолейЗапроса = ТекстПолейЗапроса + ПутьРеквизита + Разделитель;
	КонецЦикла;

	Для Каждого Реквизит Из МетаданныеЗадания.Реквизиты Цикл
		ПутьРеквизита = Реквизит.Имя;
		Если ИсключенияРеквизитов[ПутьРеквизита]=Истина Тогда
			Продолжить;
		КонецЕсли;
		Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		Поле.Поле = ПутьРеквизита;
		Поле.ПутьКДанным = "Задание." + ПутьРеквизита;
		ТекстПолейЗапроса = ТекстПолейЗапроса + ПутьРеквизита + Разделитель;
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеЗадания.ТабличныеЧасти Цикл
		Если ИсключенияРеквизитов[ТабличнаяЧасть.Имя]=Истина Тогда
			Продолжить;
		КонецЕсли;

		Поле = НаборДанных.Поля.Добавить(Тип("ВложенныйНаборДанныхСхемыКомпоновкиДанных"));
		Поле.Поле = ТабличнаяЧасть.Имя;
		Поле.ПутьКДанным = "Задание." + Поле.Поле;

		ТекстПолейЗапроса = ТекстПолейЗапроса + Поле.Поле + ".(" + Символы.ПС + Символы.Таб + Символы.Таб;
		Разделитель0 = Разделитель;
		Разделитель = Разделитель + Символы.Таб;
		
		Для Каждого Реквизит Из ТабличнаяЧасть.СтандартныеРеквизиты Цикл
			ПутьРеквизита = ТабличнаяЧасть.Имя + "." + Реквизит.Имя;
			Если ИсключенияРеквизитов[ПутьРеквизита]=Истина Тогда
				Продолжить;
			КонецЕсли;
			Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			Поле.Поле = ПутьРеквизита;
			Поле.ПутьКДанным = "Задание." + ПутьРеквизита;
			ТекстПолейЗапроса = ТекстПолейЗапроса + ПутьРеквизита + Разделитель;
		КонецЦикла;

		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			ПутьРеквизита = ТабличнаяЧасть.Имя + "." + Реквизит.Имя;
			Если ИсключенияРеквизитов[ПутьРеквизита]=Истина Тогда
				Продолжить;
			КонецЕсли;
			
			СинонимыРеквизита = СинонимыРеквизитов[ПутьРеквизита];
			Если СинонимыРеквизита=Неопределено Тогда
				СинонимыРеквизита = Новый Массив;
				СинонимыРеквизита.Добавить(ПутьРеквизита);
			Иначе
				СинонимыРеквизита = РК.ЗначениеВМассив(СинонимыРеквизита);
			КонецЕсли;
			
			Для Каждого СинонимРеквизита Из СинонимыРеквизита Цикл
				Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
				Поле.Поле = ПутьРеквизита;
				Поле.ПутьКДанным = "Задание." + СинонимРеквизита;
				Если ДобавленныеПоляЗапроса[ПутьРеквизита] <> Истина Тогда
					ТекстПолейЗапроса = ТекстПолейЗапроса + ПутьРеквизита + Разделитель;
					ДобавленныеПоляЗапроса[ПутьРеквизита] = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если Прав(ТекстПолейЗапроса, СтрДлина(Разделитель))=Разделитель Тогда
			ТекстПолейЗапроса = Лев(ТекстПолейЗапроса, СтрДлина(ТекстПолейЗапроса)-СтрДлина(Разделитель));
		КонецЕсли;
		Разделитель = Разделитель0;
		ТекстПолейЗапроса = ТекстПолейЗапроса + Символы.ПС + Символы.Таб + ")" + Разделитель;
		
	КонецЦикла;

	Если Прав(ТекстПолейЗапроса, СтрДлина(Разделитель))=Разделитель Тогда
		ТекстПолейЗапроса = Лев(ТекстПолейЗапроса, СтрДлина(ТекстПолейЗапроса)-СтрДлина(Разделитель));
	КонецЕсли;
	
	НаборДанных.Запрос = 	"ВЫБРАТЬ
							|	" + ТекстПолейЗапроса + "
							|ИЗ
							|	" + МетаданныеЗадания.ПолноеИмя();
	
	Возврат СКД;
	
КонецФункции

Функция ПустаяСтруктураНастройкиПолей() Экспорт
	
	Возврат СтруктураНастройкиПолей(СоздатьЭлемент());
	
КонецФункции

Функция СтруктураНастройкиПолей(НастройкаПолей) Экспорт
	
	МетаданныеНастроекПолей = МетаданныеНастройкиПолей();
	
	СтруктураНастройкиПолей = СтруктураНастройкиПолейБаза(НастройкаПолей, МетаданныеНастроекПолей);
	
	ПрочитатьСериализированныеСвойстваСтруктурыНастройкиПолей(СтруктураНастройкиПолей, МетаданныеНастроекПолей);
	
	Возврат СтруктураНастройкиПолей;
	
КонецФункции

Функция СтруктураНастройкиПолейБаза(НастройкаПолей, МетаданныеНастроекПолей) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ДанныеНастройкиПолей = ДанныеИБНастройкиПолей(НастройкаПолей);
	Если ДанныеНастройкиПолей=Неопределено Тогда
		ДанныеНастройкиПолей = НастройкаПолей; 
	КонецЕсли;
	
	СтруктураНастройкиПолей = Новый Структура;
	СтруктураНастройкиПолей.Вставить("Модифицированность", Ложь);
	
	Для Каждого Реквизит Из МетаданныеНастроекПолей.Реквизиты Цикл
		СтруктураНастройкиПолей.Вставить(Реквизит.Ключ, ДанныеНастройкиПолей[Реквизит.Ключ]);
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеНастроекПолей.ТабличныеЧасти Цикл
		ТаблицаНастройки = ДанныеНастройкиПолей[ТабличнаяЧасть.Ключ];
		Если ТипЗнч(ТаблицаНастройки)=Тип("ТаблицаЗначений") Тогда
			ТаблицаНастройки = ТаблицаНастройки.Скопировать();
		Иначе
			ТаблицаНастройки = ТаблицаНастройки.Выгрузить();
		КонецЕсли;
		
		МетаданныеТабличнойЧастиНастройки = ТабличнаяЧасть.Значение;
		Для Каждого ЭлементСериализуемыйРеквизит Из МетаданныеТабличнойЧастиНастройки.СериализуемыеРеквизиты Цикл
			СериализуемыйРеквизит = ЭлементСериализуемыйРеквизит.Значение;
			ИмяКолонки = ЭлементСериализуемыйРеквизит.Ключ;
			ТипЗначения = Новый ОписаниеТипов(СериализуемыйРеквизит.Тип, СериализуемыйРеквизит.ИнтерактивныйТип.Типы());
			РК.ИзменитьТипКолонкиТаблицыЗначений(ТаблицаНастройки, ИмяКолонки, ТипЗначения);
		КонецЦикла;
		СтруктураНастройкиПолей.Вставить(ТабличнаяЧасть.Ключ, ТаблицаНастройки);
	КонецЦикла;
	
	Возврат СтруктураНастройкиПолей;
	
КонецФункции

Функция ДанныеИБНастройкиПолей(СсылкаНастройкиПолей)
	
	Если ТипЗнч(СсылкаНастройкиПолей) <> Тип("СправочникСсылка.вмс_НастройкиПолейЗадания") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.вмс_НастройкиПолейЗадания КАК вмс_НастройкиПолейЗадания
	|ГДЕ
	|	вмс_НастройкиПолейЗадания.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНастройкиПолей);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	ДанныеИБНастройкиПолей = вмс_РаботаСКоллекциями.СтрокуТаблицыЗначенийВСтруктуру(ТаблицаЗапроса[0]);
	
	Возврат ДанныеИБНастройкиПолей;
	
КонецФункции

Функция ПрочитатьСериализированныеСвойстваСтруктурыНастройкиПолей(СтруктураНастройкиПолей, МетаданныеНастроекПолей)
	
	Перем Кэш;
	
	Для Каждого ЭлементМетаданныеОбщегоСвойстваНастройкиПолей Из МетаданныеНастроекПолей.СериализуемыеРеквизиты Цикл

		ИмяСвойства = ЭлементМетаданныеОбщегоСвойстваНастройкиПолей.Ключ;
		МетаданныеОбщегоСвойстваНастройкиПолей = ЭлементМетаданныеОбщегоСвойстваНастройкиПолей.Значение;
		
		Значение = СтруктураНастройкиПолей[ИмяСвойства];
		Значение = вмс_НастройкиПолейЗадания.ПрочитатьСериализированныеДанные(Значение, Кэш);
		Значение = МетаданныеОбщегоСвойстваНастройкиПолей.ИнтерактивныйТип.ПривестиЗначение(Значение);
		СтруктураНастройкиПолей[ИмяСвойства] = Значение;
		
	КонецЦикла;
	
	Для Каждого ЭлементМетаданныеТабличнойЧастиНастройки Из МетаданныеНастроекПолей.ТабличныеЧасти Цикл

		ИмяТабличнойЧасти = ЭлементМетаданныеТабличнойЧастиНастройки.Ключ;
		МетаданныеТабличнойЧастиНастройки = ЭлементМетаданныеТабличнойЧастиНастройки.Значение;
		Если МетаданныеТабличнойЧастиНастройки.СериализуемыеРеквизиты.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваЭлементов = СтруктураНастройкиПолей[ИмяТабличнойЧасти];
		Для Каждого СвойстваЭлемента Из СвойстваЭлементов Цикл
			
			Для Каждого ЭлементМетаданныеСвойстваЭлементаНастройки Из МетаданныеТабличнойЧастиНастройки.СериализуемыеРеквизиты Цикл
				ИмяСвойства = ЭлементМетаданныеСвойстваЭлементаНастройки.Ключ;
				МетаданныеСвойстваЭлементаНастройки = ЭлементМетаданныеСвойстваЭлементаНастройки.Значение;
				
				Значение = СвойстваЭлемента[ИмяСвойства];
				Значение = вмс_НастройкиПолейЗадания.ПрочитатьСериализированныеДанные(Значение, Кэш);
				Значение = МетаданныеСвойстваЭлементаНастройки.ИнтерактивныйТип.ПривестиЗначение(Значение);
				СвойстваЭлемента[ИмяСвойства] = Значение;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

Функция МетаданныеНастройкиПолей()
	
	МетаданныеНастройкиПолей = МетаданныеНастройкиПолейБаза();
	
	РасширениеМетаданныхНастройкиПолей(МетаданныеНастройкиПолей);
	
	АнализМетаданныхНастройкиПолей(МетаданныеНастройкиПолей);
	
	Возврат МетаданныеНастройкиПолей;
	
КонецФункции

Функция МетаданныеНастройкиПолейБаза()
	
	МетаданныеНастройкиПолей = Новый Структура;
	МетаданныеНастройкиПолей.Вставить("Реквизиты", Новый Структура);
	МетаданныеНастройкиПолей.Вставить("СериализуемыеРеквизиты", Новый Структура);
	МетаданныеНастройкиПолей.Вставить("ТабличныеЧасти", Новый Структура);
	
	МетаданныеНастройкиПолейВстроенные = Метаданные.Справочники.вмс_НастройкиПолейЗадания;
	
	Для Каждого Реквизит Из МетаданныеНастройкиПолейВстроенные.Реквизиты Цикл
		МетаданныеНастройкиПолей.Реквизиты.Вставить(Реквизит.Имя, Новый Структура("ЭтоГруппа, Тип, ИнтерактивныйТип, Заголовок", Ложь, Реквизит.Тип, Реквизит.Тип, Реквизит.Синоним));
	КонецЦикла;
	МетаданныеНастройкиПолей.Реквизиты.Удалить("Мастер");
	
	Для Каждого МетаданныеТабличнойЧастиВстроенные Из МетаданныеНастройкиПолейВстроенные.ТабличныеЧасти Цикл
		МетаданныеТабличнойЧасти = Новый Структура;
		МетаданныеТабличнойЧасти.Вставить("Реквизиты", Новый Структура);
		МетаданныеТабличнойЧасти.Вставить("СериализуемыеРеквизиты", Новый Структура);
		Для Каждого Реквизит Из МетаданныеТабличнойЧастиВстроенные.Реквизиты Цикл
			МетаданныеТабличнойЧасти.Реквизиты.Вставить(Реквизит.Имя, Новый Структура("ЭтоГруппа, Тип, ИнтерактивныйТип, Заголовок", Ложь, Реквизит.Тип, Реквизит.Тип, Реквизит.Синоним));
		КонецЦикла;
		
		МетаданныеНастройкиПолей.ТабличныеЧасти.Вставить(МетаданныеТабличнойЧастиВстроенные.Имя, МетаданныеТабличнойЧасти);
	КонецЦикла;
	
	Возврат МетаданныеНастройкиПолей;
	
КонецФункции

Функция РасширениеМетаданныхНастройкиПолей(МетаданныеНастройкиПолей)
	
	МетаданныеОбщихСвойствНастройки = МетаданныеНастройкиПолей.Реквизиты;
	Если МетаданныеОбщихСвойствНастройки.Свойство("Шрифт") Тогда
		МетаданныеОбщихСвойствНастройки.Шрифт.ИнтерактивныйТип = Новый ОписаниеТипов("Шрифт");
	КонецЕсли;
	
	// =========================================================================
	МетаданныеСвойствЭлементовНастройки = МетаданныеНастройкиПолей.ТабличныеЧасти.НастройкаПолей.Реквизиты;
	Если МетаданныеСвойствЭлементовНастройки.Свойство("ТипЗначения") Тогда
		МетаданныеСвойствЭлементовНастройки.ТипЗначения.ИнтерактивныйТип = Новый ОписаниеТипов("ОписаниеТипов");
	КонецЕсли;
	
	Если МетаданныеСвойствЭлементовНастройки.Свойство("Шрифт") Тогда
		МетаданныеСвойствЭлементовНастройки.Шрифт.ИнтерактивныйТип = Новый ОписаниеТипов("Шрифт");
	КонецЕсли;
	
КонецФункции

Функция АнализМетаданныхНастройкиПолей(МетаданныеНастройкиПолей)
	
	ОТСтрока = Новый ОписаниеТипов("Строка");
	
	МетаданныеНастройкиПолей.СериализуемыеРеквизиты.Очистить();
	Для Каждого ЭлементМетаданныеОбщееСвойствоНастройки Из МетаданныеНастройкиПолей.Реквизиты Цикл
		ИмяРеквизита = ЭлементМетаданныеОбщееСвойствоНастройки.Ключ;
		МетаданныеОбщееСвойствоНастройки = ЭлементМетаданныеОбщееСвойствоНастройки.Значение;
		Если МетаданныеОбщееСвойствоНастройки.Тип=ОТСтрока И МетаданныеОбщееСвойствоНастройки.Тип <> МетаданныеОбщееСвойствоНастройки.ИнтерактивныйТип Тогда
			МетаданныеНастройкиПолей.СериализуемыеРеквизиты.Вставить(ИмяРеквизита, МетаданныеОбщееСвойствоНастройки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементМетаданныеТабличнаяЧастьНастройки Из МетаданныеНастройкиПолей.ТабличныеЧасти Цикл
		ИмяТабличнойЧасти = ЭлементМетаданныеТабличнаяЧастьНастройки.Ключ;
		МетаданныеТабличнаяЧастьНастройки = ЭлементМетаданныеТабличнаяЧастьНастройки.Значение;
		МетаданныеТабличнаяЧастьНастройки.СериализуемыеРеквизиты.Очистить();

		Для Каждого ЭлементМетаданныеСвойстваЭлементаНастройки Из МетаданныеТабличнаяЧастьНастройки.Реквизиты Цикл
			ИмяРеквизита = ЭлементМетаданныеСвойстваЭлементаНастройки.Ключ;
			МетаданныеСвойстваЭлементаНастройки = ЭлементМетаданныеСвойстваЭлементаНастройки.Значение;
			Если МетаданныеСвойстваЭлементаНастройки.Тип=ОТСтрока И МетаданныеСвойстваЭлементаНастройки.Тип <> МетаданныеСвойстваЭлементаНастройки.ИнтерактивныйТип Тогда
				МетаданныеТабличнаяЧастьНастройки.СериализуемыеРеквизиты.Вставить(ИмяРеквизита, МетаданныеСвойстваЭлементаНастройки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
КонецФункции

Функция ЗагрузитьСтруктуруНастройкиПолей(СтруктураНастройкиПолей, НастройкаПолей) Экспорт
	
	МетаданныеНастройкиПолей = МетаданныеНастройкиПолей();
	
	Для Каждого Реквизит Из МетаданныеНастройкиПолей.Реквизиты Цикл
		
		ИмяСвойства = Реквизит.Ключ;
		
		Значение = СтруктураНастройкиПолей[ИмяСвойства];
		
		Если МетаданныеНастройкиПолей.СериализуемыеРеквизиты.Свойство(ИмяСвойства) Тогда
			Значение = вмс_НастройкиПолейЗадания.СериализоватьДанные(Значение);
		КонецЕсли;
		
		НастройкаПолей[ИмяСвойства] = Значение;
		
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеНастройкиПолей.ТабличныеЧасти Цикл
		
		ИмяТаблицы = ТабличнаяЧасть.Ключ;
		МетаданныеТабличнойЧасти = ТабличнаяЧасть.Значение;
		
		ТаблицаНастройки = НастройкаПолей[ИмяТаблицы];
		ТаблицаНастройки.Очистить();
		
		Для Каждого ЭлементТаблицыСтруктурыНастройки Из СтруктураНастройкиПолей[ИмяТаблицы] Цикл
			
			ЭлементТаблицыНастройки = ТаблицаНастройки.Добавить();
			
			Для Каждого Реквизит Из МетаданныеТабличнойЧасти.Реквизиты Цикл

				ИмяСвойства = Реквизит.Ключ;
				
				Значение = ЭлементТаблицыСтруктурыНастройки[ИмяСвойства];
				
				Если МетаданныеТабличнойЧасти.СериализуемыеРеквизиты.Свойство(ИмяСвойства) Тогда
					Значение = вмс_НастройкиПолейЗадания.СериализоватьДанные(Значение);
				КонецЕсли;
				
				ЭлементТаблицыНастройки[ИмяСвойства] = Значение;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

Функция ПриСозданииФормы(Форма, СтруктураНастройкиПолей=Неопределено) Экспорт
	
	ИнициализироватьФорму(Форма);
	
	Если СтруктураНастройкиПолей <> Неопределено Тогда
		ЗаполнитьНастройкуПолейНаФорме(Форма, СтруктураНастройкиПолей);
	КонецЕсли;
	
КонецФункции

Функция ИнициализироватьФорму(Форма) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	МетаданныеНастройкиПолей = МетаданныеНастройкиПолей();
	
	ТаблицаРеквизитовФормы = Новый ТаблицаЗначений;
	ТаблицаРеквизитовФормы.Колонки.Добавить("Имя");
	ТаблицаРеквизитовФормы.Колонки.Добавить("Путь");
	
	Для Каждого РеквизитФормы Из Форма.ПолучитьРеквизиты("") Цикл
		ЭлементРеквизитаФормы = ТаблицаРеквизитовФормы.Добавить();
		ЗаполнитьЗначенияСвойств(ЭлементРеквизитаФормы, РеквизитФормы);
	КонецЦикла;
	
	ПоискРеквизита = Новый Структура("Имя, Путь");
	ПоискРеквизита.Путь = "";

	ДобавляемыеРеквизитыФормы = Новый Массив;

	ПоискРеквизита.Имя = "НастройкаПолей_Контекст";
	Если ТаблицаРеквизитовФормы.НайтиСтроки(ПоискРеквизита).Количество()=0 Тогда
		ДобавляемыеРеквизитыФормы.Добавить(Новый РеквизитФормы("НастройкаПолей_Контекст", Новый ОписаниеТипов("Строка")));

		ЭлементРеквизитаФормы = ТаблицаРеквизитовФормы.Добавить();
		ЗаполнитьЗначенияСвойств(ЭлементРеквизитаФормы, РеквизитФормы);
	КонецЕсли;
	
	Путь = "НастройкаПолей_СвойстваЭлементов";
	ПоискРеквизита.Имя = Путь;
	Если ТаблицаРеквизитовФормы.НайтиСтроки(ПоискРеквизита).Количество() > 0 Тогда
		Для Каждого РеквизитФормы Из Форма.ПолучитьРеквизиты(Путь) Цикл
			ЭлементРеквизитаФормы = ТаблицаРеквизитовФормы.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементРеквизитаФормы, РеквизитФормы);
		КонецЦикла;

		ВсеРеквизиты = Новый Структура;
		Для Каждого ЭлементМетаданныеОбщееСвойствоНастройки Из МетаданныеНастройкиПолей.Реквизиты Цикл
			ВсеРеквизиты.Вставить(ЭлементМетаданныеОбщееСвойствоНастройки.Ключ, ЭлементМетаданныеОбщееСвойствоНастройки.Значение);
		КонецЦикла;
		
		Для Каждого ЭлементМетаданныеСвойстваПоля Из МетаданныеНастройкиПолей.ТабличныеЧасти.НастройкаПолей.Реквизиты Цикл
			ВсеРеквизиты.Вставить(ЭлементМетаданныеСвойстваПоля.Ключ, ЭлементМетаданныеСвойстваПоля.Значение);
		КонецЦикла;
		
		ПоискРеквизита.Путь = Путь;
		Для Каждого ЭлементМетаданныеСвойстваПоля Из ВсеРеквизиты Цикл
			ИмяСвойства = ЭлементМетаданныеСвойстваПоля.Ключ;
			МетаданныеСвойстваПоля = ЭлементМетаданныеСвойстваПоля.Значение;

			ПоискРеквизита.Имя = ИмяСвойства;
			Если ТаблицаРеквизитовФормы.НайтиСтроки(ПоискРеквизита).Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;

			РеквизитФормы = Новый РеквизитФормы(ИмяСвойства, МетаданныеСвойстваПоля.ИнтерактивныйТип, Путь, МетаданныеСвойстваПоля.Заголовок);
			ДобавляемыеРеквизитыФормы.Добавить(РеквизитФормы);

			ЭлементРеквизитаФормы = ТаблицаРеквизитовФормы.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементРеквизитаФормы, РеквизитФормы);
		КонецЦикла;

		СлужебныеСвойстваЭлементовНастройкиПолейНаФорме = Новый Структура;
		СлужебныеСвойстваЭлементовНастройкиПолейНаФорме.Вставить("Представление",			Новый Структура("ИнтерактивныйТип", Новый ОписаниеТипов("Строка")));
		СлужебныеСвойстваЭлементовНастройкиПолейНаФорме.Вставить("СборщикДанных",			Новый Структура("ИнтерактивныйТип", Новый ОписаниеТипов("Строка")));
		СлужебныеСвойстваЭлементовНастройкиПолейНаФорме.Вставить("ТипЭлементаНастройки",	Новый Структура("ИнтерактивныйТип", Новый ОписаниеТипов("Строка")));
		Для Каждого ЭлементСлужебноеСвойствоЭлементовНастройкиПолейНаФорме Из СлужебныеСвойстваЭлементовНастройкиПолейНаФорме Цикл
			ИмяСвойства = ЭлементСлужебноеСвойствоЭлементовНастройкиПолейНаФорме.Ключ;
			СлужебноеСвойствоЭлементовНастройкиПолейНаФорме = ЭлементСлужебноеСвойствоЭлементовНастройкиПолейНаФорме.Значение;

			ПоискРеквизита.Имя = ИмяСвойства;
			Если ТаблицаРеквизитовФормы.НайтиСтроки(ПоискРеквизита).Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;

			РеквизитФормы = Новый РеквизитФормы(ИмяСвойства, СлужебноеСвойствоЭлементовНастройкиПолейНаФорме.ИнтерактивныйТип, Путь);
			ДобавляемыеРеквизитыФормы.Добавить(РеквизитФормы);

			ЭлементРеквизитаФормы = ТаблицаРеквизитовФормы.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементРеквизитаФормы, РеквизитФормы);
		КонецЦикла;
	КонецЕсли;
	
	Если ДобавляемыеРеквизитыФормы.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизитыФормы);
	КонецЕсли;
	
	СписокОсновныхСвойствЭлементов = Новый Массив;
	СписокОсновныхСвойствЭлементов.Добавить("Страница");
	ТабличноеПоле_СвойстваПолей = Форма.Элементы.Найти("НастройкаПолей_СвойстваЭлементов");
	Если ТабличноеПоле_СвойстваПолей <> Неопределено Тогда
		ОбходЭлементов = Новый Массив;
		ОбходЭлементов.Добавить(ТабличноеПоле_СвойстваПолей);
		Для Каждого ЭлементОбхода Из ОбходЭлементов Цикл
			Если ТипЗнч(ЭлементОбхода)=Тип("ТаблицаФормы") ИЛИ ТипЗнч(ЭлементОбхода)=Тип("ГруппаФормы") Тогда
				Для Каждого ПодчиненныйЭлемент Из ЭлементОбхода.ПодчиненныеЭлементы Цикл
					ОбходЭлементов.Добавить(ПодчиненныйЭлемент);
				КонецЦикла;
			ИначеЕсли ТипЗнч(ЭлементОбхода)=Тип("ПолеФормы") Тогда
				СписокОсновныхСвойствЭлементов.Добавить(СтрЗаменить(ЭлементОбхода.ПутьКДанным, "НастройкаПолей_СвойстваЭлементов.", ""));
			КонецЕсли;
		КонецЦикла;
		
		Форма.Элементы.НастройкаПолей_СвойстваЭлементов_Имя.КнопкаВыбора = Истина;
		
		НастройкаПолей_СвойстваЭлементовКонтекстноеМеню = Форма.Элементы.Найти("НастройкаПолей_СвойстваЭлементовКонтекстноеМеню");
		Если НастройкаПолей_СвойстваЭлементовКонтекстноеМеню <> Неопределено Тогда
			ДобавитьКнопкуНаФорме(Форма, "НастройкаПолей_СвойстваЭлементов_ДобавитьСтраницу", "Добавить страницу", НастройкаПолей_СвойстваЭлементовКонтекстноеМеню);
		КонецЕсли;
	КонецЕсли;
	РК.УдалитьДублиВМассиве(СписокОсновныхСвойствЭлементов);
	
	Контекст = Новый Структура;
	Контекст.Вставить("МетаданныеНастройкиПолей", МетаданныеНастройкиПолей);
	Контекст.Вставить("ПрефиксСтраницОперации", Обработки.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная.ПрефиксСтраницОперации());
	Контекст.Вставить("СписокОсновныхСвойствЭлементов", СписокОсновныхСвойствЭлементов);
	Контекст.Вставить("ТаблицаДополнительныхСвойствЭлементов", ТаблицаДополнительныхСвойствЭлементов(Контекст));
	Контекст.Вставить("СКДРеквизитовЗадания", СКДРеквизитовЗадания());
	Контекст.Вставить("ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию", Обработки.вмс_СерверУправляемыйМодульОперацияПоЯчейкамУниверсальная.ТаблицаЗначенийСвойствПолейОперацииПоУмолчанию());
	Контекст.Вставить("ПризнакНесохраненныхИзмененийНастройкиПолей", Ложь);
	Контекст.Вставить("ОбработаноПередЗаписью", Ложь);
	
	Форма.НастройкаПолей_Контекст = ПоместитьВоВременноеХранилище(Контекст, Форма.УникальныйИдентификатор);
	
КонецФункции

Функция ДобавитьКнопкуНаФорме(Форма, Имя, Заголовок, Группа=Неопределено)
	
	Команда = Форма.Команды.Добавить(Имя);
	Команда.Действие = "НастройкаПолей_Команда";
	Команда.Заголовок = Заголовок;
	
	Кнопка = Форма.Элементы.Добавить(Имя, Тип("КнопкаФормы"), Группа);
	Кнопка.ИмяКоманды = Имя;
	
КонецФункции

Функция ЗаполнитьНастройкуПолейНаФорме(Форма, СтруктураНастройкиПолей) Экспорт
		
	РК = вмс_РаботаСКоллекциями;
	
	Контекст = ПолучитьИзВременногоХранилища(Форма.НастройкаПолей_Контекст);
	
	МетаданныеОбщихСвойствНастройки = Контекст.МетаданныеНастройкиПолей.Реквизиты;
	МетаданныеСвойствЭлементовНастройки = Контекст.МетаданныеНастройкиПолей.ТабличныеЧасти.НастройкаПолей.Реквизиты;
	
	ЭлементыУровень1 = Форма.НастройкаПолей_СвойстваЭлементов.ПолучитьЭлементы();
	ЭлементыУровень1.Очистить();
	ЭлементКорень = ЭлементыУровень1.Добавить();
	ЭлементКорень.Имя = "Форма";
	ЭлементКорень.ТипЭлементаНастройки = "Форма";
	ЭлементКорень.КартинкаЭлемента = БиблиотекаКартинок.вмс_Форма;
	
	Для Каждого ЭлементМетаданныеОбщегоСвойстваНастройки Из МетаданныеОбщихСвойствНастройки Цикл
		ИмяСвойства = ЭлементМетаданныеОбщегоСвойстваНастройки.Ключ;
		ЭлементКорень[ИмяСвойства] = СтруктураНастройкиПолей[ИмяСвойства];
	КонецЦикла;
	
	СвойстваЭлементов = СтруктураНастройкиПолей.НастройкаПолей;
	
	ЭлементыСтраницы = ЭлементКорень.ПолучитьЭлементы();
	Для Каждого НастройкаСтраницы Из СтруктураНастройкиПолей.НастройкаСтраниц Цикл
		ЭлементСтраница = ЭлементыСтраницы.Добавить();
		ЭлементСтраница.Имя = НастройкаСтраницы.Имя;
		ЭлементСтраница.ТипЭлементаНастройки = "Страница";
		ЭлементСтраница.СборщикДанных = НастройкаСтраницы.СборщикДанных;
		вмс_НастройкиПолейЗадания.ПриИзмененииЭлементаНастройки(Форма, ЭлементСтраница);
		
		ПоляСтраницы = СвойстваЭлементов.НайтиСтроки(Новый Структура("Страница", ЭлементСтраница.Страница));
		ЭлементыПоляСтраницы = ЭлементСтраница.ПолучитьЭлементы();
		Для Каждого ПолеСтраницы Из ПоляСтраницы Цикл
			ЭлементПолеСтраницы = ЭлементыПоляСтраницы.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементПолеСтраницы, ПолеСтраницы);
			ЭлементПолеСтраницы.Имя = ПолеСтраницы.Имя;
			ЭлементПолеСтраницы.ТипЭлементаНастройки = "Поле";
			Для Каждого ЭлементМетаданныеСвойстваЭлементаНастройки Из МетаданныеСвойствЭлементовНастройки Цикл
				ИмяСвойства = ЭлементМетаданныеСвойстваЭлементаНастройки.Ключ;
				ЭлементПолеСтраницы[ИмяСвойства] = ПолеСтраницы[ИмяСвойства];
			КонецЦикла;
			вмс_НастройкиПолейЗадания.ПриИзмененииЭлементаНастройки(Форма, ЭлементПолеСтраницы);
		КонецЦикла;
	КонецЦикла;		
	
КонецФункции

Процедура ПередЗаписьюНаФорме(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Контекст = ПолучитьИзВременногоХранилища(Форма.НастройкаПолей_Контекст);
	Контекст.ОбработаноПередЗаписью = Ложь;
	СтруктураНастройкиПолейДляСохранения = вмс_НастройкиПолейЗадания.СтруктураНастройкиПолейИзДанныхФормы(Форма);
	Контекст.Вставить("СтруктураНастройкиПолейДляСохранения", СтруктураНастройкиПолейДляСохранения);
	Если ТипЗнч(ТекущийОбъект) <> Тип("СправочникОбъект.вмс_НастройкиПолейЗадания") Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
			// если это не новый владелец, то сохраним настройки сразу,
			// чтобы на момент изменения владельца, настройки были уже актуальными
			// это полезно при сохранении настройки полей для задания кладовщику,
			// чтобы когда операция обнаружит то, что задание изменилось, она переинициализировалась с
			// уже актуальными настройками полей
			СсылкаНастройкиПолей = ПолучитьНастройкуПолейПоВладельцу(ТекущийОбъект.Ссылка);
			ОбновитьНастройкуПолей(СсылкаНастройкиПолей, СтруктураНастройкиПолейДляСохранения);
			Контекст.ОбработаноПередЗаписью = Истина;
		Иначе
			// будет обработано после записи владельца
		КонецЕсли;
	Иначе
		ЗагрузитьСтруктуруНастройкиПолей(СтруктураНастройкиПолейДляСохранения, ТекущийОбъект);
		Контекст.ОбработаноПередЗаписью = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиНаФорме(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт

	Контекст = ПолучитьИзВременногоХранилища(Форма.НастройкаПолей_Контекст);

	Если Контекст.ОбработаноПередЗаписью Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущийОбъект) <> Тип("СправочникОбъект.вмс_НастройкиПолейЗадания") Тогда
		Если Контекст.Свойство("СтруктураНастройкиПолейДляСохранения") Тогда
			СтруктураНастройкиПолейДляСохранения = Контекст.СтруктураНастройкиПолейДляСохранения;
		Иначе
			СтруктураНастройкиПолейДляСохранения = вмс_НастройкиПолейЗадания.СтруктураНастройкиПолейИзДанныхФормы(Форма);
		КонецЕсли;
		
		СсылкаНастройкиПолей = ПолучитьНастройкуПолейПоВладельцу(ТекущийОбъект.Ссылка);
		ОбновитьНастройкуПолей(СсылкаНастройкиПолей, СтруктураНастройкиПолейДляСохранения);
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаДополнительныхСвойствЭлементов(Контекст)
	
	РК = вмс_РаботаСКоллекциями;
	
	МетаданныеОбщихСвойствНастройки = Контекст.МетаданныеНастройкиПолей.Реквизиты;
	МетаданныеСвойствЭлементовНастройки = Контекст.МетаданныеНастройкиПолей.ТабличныеЧасти.НастройкаПолей.Реквизиты;

	ПоляТаблицы = "ТипЭлементаНастройки, ИмяСвойства, ТипСвойства, СписокВыбора";
	ТаблицаДополнительныхСвойствЭлементов = РК.НоваяКоллекцияЗначений("ТипЭлементаНастройки, ИмяСвойства, ТипСвойства, СписокВыбора, ЗначениеПоУмолчанию");
	
	// дополнительные свойства страницы
	РК.ДобавитьЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура(ПоляТаблицы, "Страница", "Представление", "Строка"));
	РК.ДобавитьЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура(ПоляТаблицы, "Страница", "Вывод", "Булево"));
	РК.ДобавитьЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура(ПоляТаблицы, "Страница", "СборщикДанных", "Строка"));
	
	// дополнительные свойства поля
	Для Каждого ЭлементМетаданныеСвойстваЭлементаНастройки Из МетаданныеСвойствЭлементовНастройки Цикл
		ИмяСвойства = ЭлементМетаданныеСвойстваЭлементаНастройки.Ключ;
		РК.ДобавитьЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура(ПоляТаблицы, "Поле", ИмяСвойства));
	КонецЦикла;
	
	ДопСвойство = РК.НайтиЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура("ИмяСвойства", "ПоложениеЗаголовка"));
	Если ДопСвойство <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДопСвойство, Новый Структура(ПоляТаблицы, "Поле", "ПоложениеЗаголовка", "Строка", "Авто, Лево, Право, Нет", "Авто"));
	КонецЕсли;
	
	ДопСвойство = РК.НайтиЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура("ИмяСвойства", "ОбязательныйВвод"));
	Если ДопСвойство <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДопСвойство, Новый Структура(ПоляТаблицы, "Поле", "ОбязательныйВвод", "Булево", , Истина));
	КонецЕсли;
	
	ДопСвойство = РК.НайтиЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура("ИмяСвойства", "ОбязательноеЗаполнение"));
	Если ДопСвойство <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДопСвойство, Новый Структура(ПоляТаблицы, "Поле", "ОбязательноеЗаполнение", "Булево", , Истина));
	КонецЕсли;
	
	// дополнительные свойства формы (также общие свойства элементов, которые наследуются от свойств формы)
	Для Каждого ЭлементМетаданныеОбщегоСвойстваНастройки Из МетаданныеОбщихСвойствНастройки Цикл
		ИмяСвойства = ЭлементМетаданныеОбщегоСвойстваНастройки.Ключ;
		РК.ДобавитьЭлементКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура(ПоляТаблицы, "Форма", ИмяСвойства));
	КонецЦикла;
	
	// нормализация
	Для Каждого ДополнительноеСвойствоЭлементаНастройки Из РК.ПолучитьЭлементыКоллекции(ТаблицаДополнительныхСвойствЭлементов) Цикл
		Если ДополнительноеСвойствоЭлементаНастройки.ТипСвойства=Неопределено И МетаданныеСвойствЭлементовНастройки.Свойство(ДополнительноеСвойствоЭлементаНастройки.ИмяСвойства) Тогда
			ДополнительноеСвойствоЭлементаНастройки.ТипСвойства = МетаданныеСвойствЭлементовНастройки[ДополнительноеСвойствоЭлементаНастройки.ИмяСвойства].ИнтерактивныйТип;
		ИначеЕсли ТипЗнч(ДополнительноеСвойствоЭлементаНастройки.ТипСвойства)=Тип("Строка") Тогда
			ДополнительноеСвойствоЭлементаНастройки.ТипСвойства = Новый ОписаниеТипов(ДополнительноеСвойствоЭлементаНастройки.ТипСвойства);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОсновноеСвойствоЭлемента Из Контекст.СписокОсновныхСвойствЭлементов Цикл
		Для Каждого ДополнительноеСвойствоЭлементаНастройки Из РК.НайтиЭлементыКоллекции(ТаблицаДополнительныхСвойствЭлементов, Новый Структура("ИмяСвойства", ОсновноеСвойствоЭлемента)) Цикл
			ТаблицаДополнительныхСвойствЭлементов.Удалить(ДополнительноеСвойствоЭлементаНастройки);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаДополнительныхСвойствЭлементов;
	
КонецФункции

//////////////////////////////////////////////////////////////////
//
//					Настройка полей1 (Новая)+
//

Функция ЗаполнитьНастройкуПолейПоУмолчанию1(НастройкиИБ) Экспорт
	
	Настройка = ПолучитьНастройкуПолейПоУмолчанию1();
	
	вмс_НастройкиПолейЗадания1.СохранитьНастройку(Настройка, НастройкиИБ);
	
КонецФункции

Функция ПолучитьНастройкуПолейПоУмолчанию1() Экспорт

	НПЗ = вмс_НастройкиПолейЗадания1;
	
	Настройка = НПЗ.НоваяНастройка();
	НПЗ.ДобавитьЭлементВывода(Настройка, "ФормаКлиентскогоПриложения", , , "Форма");
	НПЗ.ДобавитьЭлементВывода(Настройка, "ГруппаФормы", "Страницы", "Форма", "ГлавнаяПанель");
	
	НачатьКонструированиеЭлементов(Настройка);
	
		ДобавитьСтраницуВводаДанных(Настройка, "Инфо");
		ДобавитьСборщикДанных(Настройка, "СборщикДанныхИнфо", "СборщикДанныхСтандартный");
		ЗакончитьКонструированиеСтраницыВводаДанных(Настройка);

		ДобавитьСтраницуВводаДанных(Настройка, "ВводДанных");
		ДобавитьСтраницуВводаДанных(Настройка, "ПланФакт");
		ДобавитьСборщикДанных(Настройка, "СборщикДанныхТоваров", "СборщикДанныхТоваров");
		ДобавитьСборщикДанных(Настройка, "СборщикДанныхМаркировки", "СборщикДанныхМаркировки");
		ЗакончитьКонструированиеСтраницыВводаДанных(Настройка);
		ЗакончитьКонструированиеСтраницыВводаДанных(Настройка);
	
		ДобавитьСтраницуВводаДанных(Настройка, "Завершение");
		ДобавитьСборщикДанных(Настройка, "СборщикДанныхЗавершение", "СборщикДанныхСтандартный");
		ЗакончитьКонструированиеСтраницыВводаДанных(Настройка);
		
	ЗакончитьКонструированиеЭлементов(Настройка);
	
	Возврат Настройка;
	
КонецФункции

// Алиасы
Функция НачатьКонструированиеЭлементов(Настройка)
	
	Возврат вмс_НастройкиПолейЗадания1.НачатьКонструированиеЭлементов(Настройка);
	
КонецФункции

Функция ЗакончитьКонструированиеЭлементов(Настройка)
	
	Возврат вмс_НастройкиПолейЗадания1.ЗакончитьКонструированиеЭлементов(Настройка);
	
КонецФункции

Функция ДобавитьСтраницуВводаДанных(Настройка, Имя)

	Возврат вмс_НастройкиПолейЗадания1.ДобавитьСтраницуВводаДанных(Настройка, Имя);
	
КонецФункции

Функция ДобавитьСборщикДанных(Настройка, Имя, Тип)

	Возврат вмс_НастройкиПолейЗадания1.ДобавитьСборщикДанных(Настройка, Имя, Тип);
	
КонецФункции

Функция НачатьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода)
	
	Возврат вмс_НастройкиПолейЗадания1.НачатьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода);
	
КонецФункции

Функция ЗакончитьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода=Неопределено)
	
	Возврат вмс_НастройкиПолейЗадания1.ЗакончитьКонструированиеСтраницыВводаДанных(Настройка, СтраницаВвода);
	
КонецФункции

Функция ДобавитьПолеДанных(Настройка, Имя)

	Возврат вмс_НастройкиПолейЗадания1.ДобавитьПолеДанных(Настройка, , Имя);
	
КонецФункции

//
//					Настройка полей1 (Новая)-
//
//////////////////////////////////////////////////////////////////

#КонецЕсли
